Revit 2027 API
DirectShapeTargetViewType Enumeration
 View types for which DirectShape objects are allowed to have alternative shape representations
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum DirectShapeTargetViewType
Public Enumeration DirectShapeTargetViewType
public enum class DirectShapeTargetViewType
type DirectShapeTargetViewType
Members
Member name | Value | Description
Default | 1 |  Shape to be used in all views for which a view-specific shape was not provided
Plan | 2 |  The alternate representation will be used only in Revit Plan views
Undefined | 0 |  Invalid value
See Also
Reference
Autodesk.Revit.DB Namespace